MyMoneyfree/src/Documents/ПоступлениеДенег/ПоступлениеДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеДенег</name>
  <registerRecords>AccumulationRegister.ФинансовыеОперации</registerRecords>
  <tabularSections>
    <name>Поступления</name>
    <attributes>
      <name>Событие</name>
      <type>
        <types>CatalogRef.События</types>
      </type>
    </attributes>
    <attributes>
      <name>Друг</name>
      <type>
        <types>CatalogRef.Друзья</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyMoneyfree/src/AccumulationRegisters/ФинансовыеОперации/ФинансовыеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ФинансовыеОперации</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Друг</name>
    <type>
      <types>CatalogRef.Друзья</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

MyMoneyfree/src/Documents/ПоступлениеДенег/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ФинансовыеОперации Приход
	Движения.ФинансовыеОперации.Записывать = Истина;
	Для Каждого ТекСтрокаПоступления Из Поступления Цикл
		Движение = Движения.ФинансовыеОперации.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Событие = ТекСтрокаПоступления.Событие;
		Движение.Друг = ТекСтрокаПоступления.Друг;
		Движение.Сумма = ТекСтрокаПоступления.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
